Revit 2027 API
TableData.IsEqual Method
 Checks if this element is equal in value to the other element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	TableData OtherElem
)
Public Function IsEqual (
	OtherElem As TableData
) As Boolean
public:
bool IsEqual(
	TableData^ OtherElem
)
member IsEqual :
        OtherElem : TableData -> bool
Parameters
OtherElem TableData
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableData Class
Autodesk.Revit.DB Namespace